{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "authority",
    "1": "black-white",
    "2": "hasty_generalization",
    "3": "natural",
    "4": "population",
    "5": "slippery_slope",
    "6": "tradition",
    "7": "worse_problems"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "is_decoder": false,
  "label2id": {
    "authority": 0,
    "black-white": 1,
    "hasty_generalization": 2,
    "natural": 3,
    "population": 4,
    "slippery_slope": 5,
    "tradition": 6,
    "worse_problems": 7
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.8.1",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 50265
}
